benchmarks/results/auth-serialization/test-signup/baseline/sar-metrics/wrk2/wrk_report.txt
Running 30s test @ http://127.0.0.1:8000/api/v1/access/signup
  2 threads and 4 connections
  Thread calibration: mean lat.: 664.576ms, rate sampling interval: 1347ms
  Thread calibration: mean lat.: 657.856ms, rate sampling interval: 1346ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   661.25ms   11.32ms 676.86ms   76.00%
    Req/Sec     1.71      0.45     2.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  664.58ms
 75.000%  669.18ms
 90.000%  672.77ms
 99.000%  675.84ms
 99.900%  677.38ms
 99.990%  677.38ms
 99.999%  677.38ms
100.000%  677.38ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     621.567     0.000000            1         1.00
     643.583     0.100000           10         1.11
     653.311     0.200000           20         1.25
     658.431     0.300000           30         1.43
     660.991     0.400000           41         1.67
     664.575     0.500000           51         2.00
     666.623     0.550000           58         2.22
     667.135     0.600000           62         2.50
     667.647     0.650000           66         2.86
     668.159     0.700000           70         3.33
     669.183     0.750000           77         4.00
     669.695     0.775000           79         4.44
     670.719     0.800000           82         5.00
     671.231     0.825000           85         5.71
     671.231     0.850000           85         6.67
     672.255     0.875000           88         8.00
     672.767     0.887500           90         8.89
     672.767     0.900000           90        10.00
     673.279     0.912500           93        11.43
     673.279     0.925000           93        13.33
     673.791     0.937500           95        16.00
     673.791     0.943750           95        17.78
     673.791     0.950000           95        20.00
     675.327     0.956250           97        22.86
     675.327     0.962500           97        26.67
     675.327     0.968750           97        32.00
     675.839     0.971875           99        35.56
     675.839     0.975000           99        40.00
     675.839     0.978125           99        45.71
     675.839     0.981250           99        53.33
     675.839     0.984375           99        64.00
     675.839     0.985938           99        71.11
     675.839     0.987500           99        80.00
     675.839     0.989062           99        91.43
     677.375     0.990625          100       106.67
     677.375     1.000000          100          inf
#[Mean    =      661.248, StdDeviation   =       11.315]
#[Max     =      676.864, Total count    =          100]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  148 requests in 30.01s, 60.24KB read
Requests/sec:      4.93
Transfer/sec:      2.01KB